<!-- 189. 轮转数组
给定一个整数数组 nums，将数组中的元素向右轮转 k 个位置，其中 k 是非负数。

示例 1:
输入: nums = [1,2,3,4,5,6,7], k = 3
输出: [5,6,7,1,2,3,4]
解释:
向右轮转 1 步: [7,1,2,3,4,5,6]
向右轮转 2 步: [6,7,1,2,3,4,5]
向右轮转 3 步: [5,6,7,1,2,3,4]

示例 2:
输入：nums = [-1,-100,3,99], k = 2
输出：[3,99,-1,-100]
解释: 
向右轮转 1 步: [99,-1,-100,3]
向右轮转 2 步: [3,99,-1,-100]
 
提示：
1 <= nums.length <= 105
-231 <= nums[i] <= 231 - 1
0 <= k <= 105
 
进阶：
尽可能想出更多的解决方案，至少有 三种 不同的方法可以解决这个问题。
你可以使用空间复杂度为 O(1) 的 原地 算法解决这个问题吗？ -->

<!-- 根据题意，如果使用多余数组存储空间，会导致空间复杂度为 n，所以在这里，我们可以使用常量级的空间复杂度解法：数组翻转。

思路如下：

首先对整个数组实行翻转，这样子原数组中需要翻转的子数组，就会跑到数组最前面。
这时候，从 k 处分隔数组，左右两数组，各自进行翻转即可。 -->
<template>
    189. 轮转数组
</template>
<script setup>
    const nums1=[1,2,3,4,5,6,7];
    const nums2=[-1,-100,3,99];

var rotate = function(nums, k) {
    let arr = [...nums.reverse()]
    let left = arr.slice(0,k).reverse()
    let right = arr.slice(k).reverse()
    nums = left.concat(right)
    console.log(nums,'data----nums');
};

    rotate(nums1,3);
    rotate(nums2,2);
</script>